Autodesk.Revit.DB.ViewShapeBuilder.ValidatePoint(Autodesk.Revit.DB.Point)
Validates point to be added to the view-specific shape being constructed. Called by AddPoint() to validate input.
Remarks:
This function may be used to pre-validate the geometry being added to avoid AddPoint() throwing an InvalidArgumentException
Validation conditions depend on the type of view for which the shape representation is intended.
The current validation condition is that the point lies within a 60000' cube centered at origin.
The size of this cube is determined by the const double MAX_LENGTH, currently set at 30000'.
GPoint:
Point object to be validated.
Returns:
True is %GPoint% is acceptable as a part of view-specific shape representation being built.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021.1

Autodesk.Revit.DB.ViewShapeBuilder.ValidatePolyLine(Autodesk.Revit.DB.PolyLine)
Validates polyline to be added to the view-specific shape being constructed. Called by AddPolyLine() to validate input.
Remarks:
This function may be used to pre-validate the geometry being added to avoid AddPolyLine() throwing an InvalidArgumentException
Validation conditions depend on the type of view for which the shape representation is intended.
For plan views, a polyline is expected to be planar and non-degenerate (e.g., NOT a circle of zero radius).
GPolyLine:
Polyline object to be validated.
Returns:
True is %GPolyLine% is acceptable as a part of view-specific shape representation being built.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ViewShapeBuilder.AddPoint(Autodesk.Revit.DB.Point)
Add a point to the GRep associated to this ViewShapeBuilder.
GPoint:
The point to be added.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021.1

Autodesk.Revit.DB.ViewShapeBuilder.AddPolyLine(Autodesk.Revit.DB.PolyLine)
Add a curve to the GRep associated to this ViewShapeBuilder.
GPolyLine:
The PolyLine to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
GPolyLine is not acceptable for view-specific shape representation that is currently being built.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ViewShapeBuilder.ValidateShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
Validates a shape represented as a collection of geometry objects for use as a view-specific shape.
The objects are expected to be either points, curves or polylines.
Curves are expected to be flat and lie in a plane perpendicular to view normal as defined by view type.
Returns:
Returns true if %shape% may be used as a view-specific shape representation, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetViewType is not DirectShapeTargetViewType::Plan
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017